"use strict";

window.THREE_SUN_ENDINGS = {
  A: {
    name: "地上天国/Promised Land",
    paragraphs: [
      "终于，我们可以骄傲地宣告，人类为理想流血漂橹的日子结束了；没有天使吹响号角，也没有圣城从天而降——",
      "这应许之地，是你我亲手所造。"
    ],
    quote: "“看哪，我将一切都更新了。”——《启示录》21:5"
  },
  B: {
    name: "人间地狱/Suffer In Hell",
    paragraphs: [
      "终于，我们可以骄傲地宣告，人类为圣灵流血漂橹的日子结束了；不会有天使吹响号角，不会有圣城从天而降——",
      "你们终将归于上上善道。"
    ],
    quote: "“进入此门者，当舍弃一切希望。”——《神曲·地狱篇》，但丁，1307年"
  },
  C: {
    name: "都灵之马/The Turin Horse",
    paragraphs: [
      "这片大地人烟荒芜。可是没关系，人们拥有信仰；但是，人们仅仅拥有信仰，因为可怜的青铜器永远无法战胜三颗太阳。"
    ],
    quote: "“哦，妈妈，我真傻。”——弗里德里希·尼采，1889年"
  },
  D: {
    name: "四海为家/Space Odyssey",
    paragraphs: [
      "在无数轮灾难、饥荒、战争之后，我们登上了前往天空的飞船，告别了脚下残酷的故乡；家园垂泪，故国荒芜，我们再不回头。"
    ],
    quote: "“在朦胧的月光下，泪水涌出我的眼睛。”——《Take Me Home, Country Roads》，约翰·丹佛，1971年"
  },
  E: {
    name: "唯主是依/In God We Trust",
    paragraphs: [
      "在无数轮灾难、饥荒、战争之后，我们信仰了前往天国的正道，告别了过去迷惘的时光；土地哭泣，山脉默哀，我们无动于衷。"
    ],
    quote: "“耶和华是我的牧者，我必不至缺乏。”——《诗篇》23:1"
  },
  F: {
    name: "各执一词/Agree to Disagree",
    paragraphs: [
      "对于尚处于黎明的物种，超前的科学就如同巫术一般令人恐惧；我们又怎敢说自己不再蒙昧呢？",
      "造物主以他的博爱同时创造科学家与祭司；方程与圣歌或许本就是一体两面。",
      "——来吧，我们要作砖；将土烧透了。"
    ],
    quote: "“看哪，我们将造一座塔，为要传扬我们的名，使我们免于分散在全地上。”——《创世记》，11:4"
  },
  G: {
    name: "如梦方醒/Brave New World",
    paragraphs: [
      "城市和未来一同消失在地平线上，一如既往。幸存者拆下机器的零件，重新学习耕种、取水和辨认季节，一如既往。他们终于从进步的长梦中醒来，面对旧世界留下的废墟，一如既往。",
      "他们称其为新世界。",
      "一如既往。"
    ],
    quote: "“啊，这美丽的新世界，竟有这样的人！”——《暴风雨》，莎士比亚，1611年"
  },
  H: {
    name: "1984/Big Brother",
    paragraphs: [
      "科学只要达到这种程度就足够了。我们永远无法征服群星，但我们可以征服草民：不要抬起头，不要看你至高无上的王。",
      "双加好，双加好，老大哥在看着你。"
    ],
    quote: "“他战胜了自己，他热爱老大哥。”——《1984》，乔治·奥威尔，1949年"
  },
  I: {
    name: "罗马再临/Do As the Romans Do",
    paragraphs: [
      "总督与城邦自立为王，对抗中央政府的权威与号令。狼烟四起，大权旁落，秩序荡然无存。战争带来血仇，血仇带来新的战争；为了水源、土地、科技、正信，或者为了更好的明天。",
      "谈判破裂，大军压境，你我唯有浴血。"
    ],
    quote: "“君不见，青海头，古来白骨无人收。”——《兵车行》，杜甫，750年"
  },
  J: {
    name: "永志不忘/Here's Looking At You",
    paragraphs: [
      "我们创作小说、诗歌、画作和音乐，等待一场巨大的灾难把它们化作历史。终有一日，凡是尘土的都归于尘土；但在那之前，他们知道我们存在过。",
      "多谢后世人，戒之慎勿忘。"
    ],
    quote: "“把字刻在石头上。”——罗辑，掩体纪元67年"
  },
  K: {
    name: "万王之王/King of All Kings",
    paragraphs: [
      "众生皆苦，诸行无常。君王与公爵相互征伐，永无宁日。在征服者的军队面前，一切都化为历史。",
      "三颗太阳的光辉之下，大主教为你加冕；人海顿首朝拜，高呼万王之王。"
    ],
    quote: "“愿你的国度降临；愿你的旨意行在地上，如同行在天上。”——《马太福音》6:10"
  },
  L: {
    name: "末代皇帝/Viva La Vida",
    paragraphs: [
      "国家危亡，宗庙倾覆。敌寇与叛军势如破竹，兵临城下。在征服者的铁蹄之下，一切将归于空无。",
      "三颗太阳的光辉之下，大主教为你祈祷；人海奔走号哭，王旗悄然落地。"
    ],
    quote: "“冠冕从我们的头上掉落；我们有祸了，因为犯了罪。”——《耶利米哀歌》5:16"
  }
};
